open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_bt_transport.c
/****************************************************************************
 * BK7258 Bluetooth HCI-over-Mailbox transport.
 *
 * SPDX-License-Identifier: Apache-2.0
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <syslog.h>

#include <nuttx/clock.h>
#include <nuttx/kthread.h>
#include <nuttx/net/bluetooth.h>
#include <nuttx/semaphore.h>
#include <nuttx/signal.h>
#include <nuttx/spinlock.h>
#include <nuttx/wireless/bluetooth/bt_buf.h>
#include <nuttx/wireless/bluetooth/bt_hci.h>

#include "bk7258_bt.h"
#include "hardware/bk7258_bt_ipc.h"
#include "hardware/bk7258_mbox.h"

#define BT_TX_PRIORITY             106
#define BT_RX_PRIORITY             104
#define BT_WORKER_STACK            3072
#define BT_RETRY_TICKS             MSEC2TICK(2)
#define BT_VENDOR_TIMEOUT          MSEC2TICK(5000)
#define BT_AP_RAM_START            0x28010000u
#define BT_AP_RAM_END              0x28064000u
#define BT_COMMAND_RESERVE         2u

enum bt_pool_state
{
  BT_POOL_FREE = 0,
  BT_POOL_BUILDING,
  BT_POOL_QUEUED,
  BT_POOL_SENT,
  BT_POOL_ACKED,
  BT_POOL_FREE_SEEN,
  BT_POOL_QUARANTINED
};

enum bt_remote_state
{
  BT_REMOTE_FREE = 0,
  BT_REMOTE_QUEUED,
  BT_REMOTE_FREE_QUEUED,
  BT_REMOTE_FREE_SENT,
  BT_REMOTE_QUARANTINED
};

enum bt_tx_kind
{
  BT_TX_NONE = 0,
  BT_TX_PAYLOAD,
  BT_TX_REMOTE_FREE
};

struct bt_pool_entry
{
  uint8_t data[BLUETOOTH_MAX_FRAMELEN] __attribute__((aligned(4)));
  clock_t enqueued;
  uint32_t generation;
  uint16_t length;
  uint8_t packet_type;
  uint8_t state;
};

struct bt_remote_entry
{
  uint32_t pointer;
  uint8_t packet_type;
  uint8_t state;
};

struct bt_index_queue
{
  uint8_t entries[CONFIG_BK7258_BT_TX_QUEUE];
  uint8_t head;
  uint8_t count;
};

struct bt_control_queue
{
  uint8_t entries[CONFIG_BK7258_BT_TX_BUFFERS];
  uint8_t head;
  uint8_t count;
};

struct bt_rx_queue
{
  uint8_t entries[CONFIG_BK7258_BT_RX_QUEUE];
  uint8_t head;
  uint8_t count;
};

struct bt_current_tx
{
  uint32_t generation;
  uint8_t kind;
  uint8_t index;
  bool valid;
  bool accepted;
};

static struct bt_pool_entry
  g_tx_pool[CONFIG_BK7258_BT_TX_BUFFERS] __attribute__((aligned(32)));
static struct bt_remote_entry g_remote[CONFIG_BK7258_BT_RX_QUEUE];
static struct bt_index_queue g_normal_queue;
static struct bt_control_queue g_control_queue;
static struct bt_rx_queue g_rx_queue;
static struct bt_rx_queue g_free_queue;
static struct bt_current_tx g_current;
static struct bk7258_bt_stats g_stats;
static spinlock_t g_lock = SP_UNLOCKED;
static sem_t g_tx_sem;
static sem_t g_rx_sem;
static sem_t g_vendor_sem;
static sem_t g_pool_sem;
static bk7258_bt_receive_t g_receive;
static void *g_receive_arg;
static uint16_t g_vendor_waiting;
static int g_vendor_status;
static bool g_initialized;
static bool g_workers_created;
static bool g_host_enabled;

_Static_assert(CONFIG_BK7258_BT_TX_BUFFERS <= UINT8_MAX,
               "BT pool index width");
_Static_assert(CONFIG_BK7258_BT_TX_QUEUE <= UINT8_MAX,
               "BT TX queue index width");
_Static_assert(CONFIG_BK7258_BT_RX_QUEUE <= UINT8_MAX,
               "BT RX queue index width");

static uint16_t bt_get_le16(const uint8_t *data)
{
  return (uint16_t)data[0] | ((uint16_t)data[1] << 8);
}

static void bt_put_le16(uint8_t *data, uint16_t value)
{
  data[0] = value & 0xffu;
  data[1] = value >> 8;
}

static void bt_deliver_event(const uint8_t *data, size_t length)
{
  bk7258_bt_receive_t receive;
  void *arg;
  irqstate_t flags;

  flags = spin_lock_irqsave(&g_lock);
  receive = g_receive;
  arg = g_receive_arg;
  spin_unlock_irqrestore(&g_lock, flags);

  if (receive != NULL)
    {
      (void)receive(BT_EVT, data, length, arg);
    }
}

static void bt_inject_command_complete(uint16_t opcode)
{
  uint8_t event[] =
  {
    0x0e, 0x04, 0x01,
    (uint8_t)(opcode & 0xff), (uint8_t)(opcode >> 8), 0x00
  };

  bt_deliver_event(event, sizeof(event));
}

static void bt_inject_acl_complete(uint16_t handle)
{
  uint8_t event[] =
  {
    0x13, 0x05, 0x01,
    (uint8_t)(handle & 0xff), (uint8_t)(handle >> 8),
    0x01, 0x00
  };

  bt_deliver_event(event, sizeof(event));
}

static bool bt_pointer_range(uint32_t pointer, size_t length,
                             uint32_t start, uint32_t end)
{
  return pointer >= start && pointer < end && length <= end - pointer;
}

static bool bt_pool_pointer_valid(const void *pointer, size_t length)
{
  uintptr_t address = (uintptr_t)pointer;

  return address <= UINT32_MAX &&
         bt_pointer_range((uint32_t)address, length,
                          BT_AP_RAM_START, BT_AP_RAM_END);
}

static int bt_queue_push(uint8_t *entries, uint8_t *head, uint8_t *count,
                         unsigned int capacity, uint8_t value)
{
  unsigned int tail;

  if (*count >= capacity)
    {
      return -ENOBUFS;
    }

  tail = (*head + *count) % capacity;
  entries[tail] = value;
  (*count)++;
  return OK;
}

static int bt_queue_pop(uint8_t *entries, uint8_t *head, uint8_t *count,
                        unsigned int capacity, uint8_t *value)
{
  if (*count == 0)
    {
      return -ENOENT;
    }

  *value = entries[*head];
  *head = (*head + 1u) % capacity;
  (*count)--;
  return OK;
}

static void bt_release_pool_locked(unsigned int index)
{
  struct bt_pool_entry *entry = &g_tx_pool[index];

  entry->state = BT_POOL_FREE;
  entry->length = 0;
  entry->packet_type = 0;
  nxsem_post(&g_pool_sem);
}

static int bt_alloc_pool_locked(bool reserved, unsigned int *index)
{
  unsigned int free_count = 0;
  unsigned int candidate = CONFIG_BK7258_BT_TX_BUFFERS;
  unsigned int i;

  for (i = 0; i < CONFIG_BK7258_BT_TX_BUFFERS; i++)
    {
      if (g_tx_pool[i].state == BT_POOL_FREE)
        {
          free_count++;
          if (candidate == CONFIG_BK7258_BT_TX_BUFFERS)
            {
              candidate = i;
            }
        }
    }

  if (candidate == CONFIG_BK7258_BT_TX_BUFFERS ||
      (!reserved && free_count <= BT_COMMAND_RESERVE))
    {
      return -ENOBUFS;
    }

  g_tx_pool[candidate].state = BT_POOL_BUILDING;
  g_tx_pool[candidate].generation++;
  *index = candidate;
  return OK;
}

static void bt_handle_local_free(uint32_t pointer)
{
  irqstate_t flags;
  unsigned int i;

  flags = spin_lock_irqsave(&g_lock);
  for (i = 0; i < CONFIG_BK7258_BT_TX_BUFFERS; i++)
    {
      struct bt_pool_entry *entry = &g_tx_pool[i];

      if ((uint32_t)(uintptr_t)entry->data != pointer)
        {
          continue;
        }

      if (entry->state == BT_POOL_SENT)
        {
          entry->state = BT_POOL_FREE_SEEN;
          g_stats.tx_free++;
          spin_unlock_irqrestore(&g_lock, flags);
          return;
        }

      if (entry->state == BT_POOL_ACKED)
        {
          g_stats.tx_free++;
          bt_release_pool_locked(i);
          spin_unlock_irqrestore(&g_lock, flags);
          return;
        }

      g_stats.tx_unknown_free++;
      spin_unlock_irqrestore(&g_lock, flags);
      return;
    }

  g_stats.tx_unknown_free++;
  spin_unlock_irqrestore(&g_lock, flags);
}

static int bt_mailbox_rx(const struct bk7258_mb_wire_message *message,
                         uint8_t *ack_flags, void *arg)
{
  const union bk7258_mb_frame *frame = (const union bk7258_mb_frame *)message;
  uint32_t pointer = bk7258_bt_descriptor_pointer(&frame->bt);
  irqstate_t flags;
  unsigned int i;
  unsigned int remote_index = CONFIG_BK7258_BT_RX_QUEUE;
  int ret;

