open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_bt_transport.c
  (void)ack_flags;
  (void)arg;

  if (frame->bt.packet_type == BK7258_BT_HCI_FREE_PKT)
    {
      bt_handle_local_free(pointer);
      nxsem_post(&g_tx_sem);
      return OK;
    }

  if (frame->bt.packet_type != BK7258_BT_HCI_EVENT_PKT &&
      frame->bt.packet_type != BK7258_BT_HCI_ACL_DATA_PKT)
    {
      g_stats.rx_rejected++;
      g_stats.last_remote_pointer = pointer;
      g_stats.last_remote_type = frame->bt.packet_type;
      return -EPROTO;
    }

  if ((pointer & 3u) != 0 ||
      !bt_pointer_range(pointer, 2, BK7258_CP_RAM_START,
                        BK7258_CP_RAM_END))
    {
      g_stats.rx_rejected++;
      g_stats.last_remote_pointer = pointer;
      g_stats.last_remote_type = frame->bt.packet_type;
      return -EFAULT;
    }

  flags = spin_lock_irqsave(&g_lock);
  for (i = 0; i < CONFIG_BK7258_BT_RX_QUEUE; i++)
    {
      if (g_remote[i].state != BT_REMOTE_FREE &&
          g_remote[i].pointer == pointer)
        {
          g_stats.rx_duplicate++;
          spin_unlock_irqrestore(&g_lock, flags);
          return -EALREADY;
        }

      if (remote_index == CONFIG_BK7258_BT_RX_QUEUE &&
          g_remote[i].state == BT_REMOTE_FREE)
        {
          remote_index = i;
        }
    }

  if (remote_index == CONFIG_BK7258_BT_RX_QUEUE)
    {
      g_stats.queue_full++;
      spin_unlock_irqrestore(&g_lock, flags);
      return -EAGAIN;
    }

  ret = bt_queue_push(g_rx_queue.entries, &g_rx_queue.head,
                      &g_rx_queue.count, CONFIG_BK7258_BT_RX_QUEUE,
                      remote_index);
  if (ret < 0)
    {
      g_stats.queue_full++;
      spin_unlock_irqrestore(&g_lock, flags);
      return -EAGAIN;
    }

  g_remote[remote_index].pointer = pointer;
  g_remote[remote_index].packet_type = frame->bt.packet_type;
  g_remote[remote_index].state = BT_REMOTE_QUEUED;
  g_stats.rx_enqueued++;
  spin_unlock_irqrestore(&g_lock, flags);
  nxsem_post(&g_rx_sem);
  return OK;
}

static int bt_enqueue_pool(const void *data, size_t length,
                           uint8_t packet_type, bool priority, bool reserved,
                           unsigned int *pool_index,
                           uint32_t *generation)
{
  struct bt_pool_entry *entry;
  irqstate_t flags;
  unsigned int index;
  int ret;

  flags = spin_lock_irqsave(&g_lock);
  ret = bt_alloc_pool_locked(reserved, &index);
  spin_unlock_irqrestore(&g_lock, flags);
  if (ret < 0)
    {
      return ret;
    }

  entry = &g_tx_pool[index];
  if (!bt_pool_pointer_valid(entry->data, length))
    {
      flags = spin_lock_irqsave(&g_lock);
      bt_release_pool_locked(index);
      spin_unlock_irqrestore(&g_lock, flags);
      return -EFAULT;
    }

  memcpy(entry->data, data, length);
  __asm__ volatile("dmb sy" ::: "memory");

  flags = spin_lock_irqsave(&g_lock);
  entry->length = length;
  entry->packet_type = packet_type;
  entry->enqueued = clock_systime_ticks();
  entry->state = BT_POOL_QUEUED;

  if (priority)
    {
      ret = bt_queue_push(g_control_queue.entries, &g_control_queue.head,
                          &g_control_queue.count,
                          CONFIG_BK7258_BT_TX_BUFFERS, index);
    }
  else
    {
      ret = bt_queue_push(g_normal_queue.entries, &g_normal_queue.head,
                          &g_normal_queue.count,
                          CONFIG_BK7258_BT_TX_QUEUE, index);
    }

  if (ret < 0)
    {
      bt_release_pool_locked(index);
      g_stats.queue_full++;
      spin_unlock_irqrestore(&g_lock, flags);
      return ret;
    }

  g_stats.tx_enqueued++;
  if (packet_type == BK7258_BT_HCI_COMMAND_PKT)
    {
      g_stats.tx_commands++;
    }
  else if (packet_type == BK7258_BT_HCI_ACL_DATA_PKT)
    {
      g_stats.tx_acl++;
    }
  if (pool_index != NULL)
    {
      *pool_index = index;
    }

  if (generation != NULL)
    {
      *generation = entry->generation;
    }

  spin_unlock_irqrestore(&g_lock, flags);
  nxsem_post(&g_tx_sem);
  return OK;
}

static void bt_tx_complete(const struct bk7258_mb_wire_message *ack,
                           int result, void *arg)
{
  irqstate_t flags;
  struct bt_current_tx current;
  bool acl_complete = false;
  uint16_t acl_handle = 0;

  (void)ack;
  (void)arg;

  flags = spin_lock_irqsave(&g_lock);
  current = g_current;
  memset(&g_current, 0, sizeof(g_current));

  if (!current.valid || !current.accepted)
    {
      spin_unlock_irqrestore(&g_lock, flags);
      return;
    }

  if (current.kind == BT_TX_PAYLOAD &&
      current.index < CONFIG_BK7258_BT_TX_BUFFERS)
    {
      struct bt_pool_entry *entry = &g_tx_pool[current.index];

      if (entry->generation == current.generation)
        {
          if (result == OK)
            {
              g_stats.tx_ack++;
              if (entry->packet_type == BK7258_BT_HCI_ACL_DATA_PKT &&
                  entry->length >= 4)
                {
                  acl_handle = bt_get_le16(&entry->data[0]) & 0x0fffu;
                  acl_complete = true;
                }
              if (entry->state == BT_POOL_FREE_SEEN)
                {
                  bt_release_pool_locked(current.index);
                }
              else if (entry->state == BT_POOL_SENT)
                {
                  entry->state = BT_POOL_ACKED;
                }
            }
          else if (entry->state == BT_POOL_FREE_SEEN)
            {
              bt_release_pool_locked(current.index);
            }
          else
            {
              entry->state = BT_POOL_QUARANTINED;
              g_stats.tx_ack_error++;
              g_stats.tx_quarantined++;
            }
        }
    }
  else if (current.kind == BT_TX_REMOTE_FREE &&
           current.index < CONFIG_BK7258_BT_RX_QUEUE)
    {
      struct bt_remote_entry *remote = &g_remote[current.index];

      if (result == OK && remote->state == BT_REMOTE_FREE_SENT)
        {
          memset(remote, 0, sizeof(*remote));
          g_stats.rx_free_ack++;
        }
      else if (remote->state != BT_REMOTE_FREE)
        {
          remote->state = BT_REMOTE_QUARANTINED;
          g_stats.rx_free_quarantined++;
        }
    }

  spin_unlock_irqrestore(&g_lock, flags);

  if (acl_complete)
    {
      bt_inject_acl_complete(acl_handle);
    }

  nxsem_post(&g_tx_sem);
}

