open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_bt_transport.c
static bool bt_select_current_locked(void)
{
  uint8_t index;

  if (g_current.valid)
    {
      return true;
    }

  if (bt_queue_pop(g_free_queue.entries, &g_free_queue.head,
                   &g_free_queue.count, CONFIG_BK7258_BT_RX_QUEUE,
                   &index) == OK)
    {
      g_current.kind = BT_TX_REMOTE_FREE;
      g_current.index = index;
      g_current.valid = true;
      g_remote[index].state = BT_REMOTE_FREE_SENT;
      return true;
    }

  if (bt_queue_pop(g_control_queue.entries, &g_control_queue.head,
                   &g_control_queue.count, CONFIG_BK7258_BT_TX_BUFFERS,
                   &index) == OK ||
      bt_queue_pop(g_normal_queue.entries, &g_normal_queue.head,
                   &g_normal_queue.count, CONFIG_BK7258_BT_TX_QUEUE,
                   &index) == OK)
    {
      g_current.kind = BT_TX_PAYLOAD;
      g_current.index = index;
      g_current.generation = g_tx_pool[index].generation;
      g_current.valid = true;
      g_tx_pool[index].state = BT_POOL_SENT;
      return true;
    }

  return false;
}

static int bt_dispatch_current(void)
{
  union bk7258_mb_frame frame;
  struct bt_current_tx current;
  uint32_t pointer;
  irqstate_t flags;
  int ret;

  flags = spin_lock_irqsave(&g_lock);
  if (!bt_select_current_locked() || g_current.accepted)
    {
      spin_unlock_irqrestore(&g_lock, flags);
      return OK;
    }

  g_current.accepted = true;
  current = g_current;
  if (current.kind == BT_TX_PAYLOAD)
    {
      pointer = (uint32_t)(uintptr_t)g_tx_pool[current.index].data;
    }
  else
    {
      pointer = g_remote[current.index].pointer;
    }

  memset(&frame, 0, sizeof(frame));
  frame.bt.packet_type = current.kind == BT_TX_REMOTE_FREE ?
                         BK7258_BT_HCI_FREE_PKT :
                         g_tx_pool[current.index].packet_type;
  bk7258_bt_descriptor_set_pointer(&frame.bt, pointer);
  spin_unlock_irqrestore(&g_lock, flags);

  __asm__ volatile("dmb sy" ::: "memory");
  ret = bk7258_mailbox_send_raw(BK7258_MB_CHAN_BT_TX, frame.raw,
                                bt_tx_complete, NULL);

  flags = spin_lock_irqsave(&g_lock);
  if (ret != OK && g_current.valid &&
      g_current.kind == current.kind && g_current.index == current.index &&
      g_current.generation == current.generation)
    {
      if (ret != -EBUSY && ret != -EAGAIN)
        {
          if (current.kind == BT_TX_PAYLOAD)
            {
              g_tx_pool[current.index].state = BT_POOL_QUARANTINED;
              g_stats.tx_quarantined++;
            }
          else
            {
              g_remote[current.index].state = BT_REMOTE_QUARANTINED;
              g_stats.rx_free_quarantined++;
            }

          memset(&g_current, 0, sizeof(g_current));
        }
      else
        {
          g_current.accepted = false;
        }
    }

  spin_unlock_irqrestore(&g_lock, flags);
  return ret;
}

static int bt_tx_worker(int argc, char **argv)
{
  (void)argc;
  (void)argv;

  for (;;)
    {
      int ret;

      nxsem_wait_uninterruptible(&g_tx_sem);
      nxsem_reset(&g_tx_sem, 0);
      ret = bt_dispatch_current();
      if (ret == -EBUSY || ret == -EAGAIN)
        {
          nxsig_usleep(TICK2USEC(BT_RETRY_TICKS));
          nxsem_post(&g_tx_sem);
        }
    }

  return OK;
}

static bool bt_vendor_event(const uint8_t *data, size_t length)
{
  irqstate_t flags;
  uint16_t subopcode;
  bool vendor;

  if (length != 5 || data[0] != BK7258_BT_VENDOR_EVENT || data[1] != 3)
    {
      return false;
    }

  subopcode = bt_get_le16(&data[2]);
  if (subopcode != BK7258_BT_VENDOR_INIT &&
      subopcode != BK7258_BT_VENDOR_DEINIT)
    {
      return false;
    }

  flags = spin_lock_irqsave(&g_lock);
  vendor = true;
  if (g_vendor_waiting == subopcode)
    {
      g_vendor_status = data[4] == 0 ? OK : -EREMOTEIO;
      g_vendor_waiting = 0;
      nxsem_post(&g_vendor_sem);
    }
  else
    {
      syslog(LOG_WARNING, "bluetooth: stray vendor event subop=%04x\n",
             subopcode);
    }

  spin_unlock_irqrestore(&g_lock, flags);
  return vendor;
}

static int bt_read_remote(unsigned int index, uint8_t *data, size_t *length)
{
  const uint8_t *remote;
  uint32_t pointer = g_remote[index].pointer;
  size_t total;

  __asm__ volatile("dmb sy" ::: "memory");
  remote = (const uint8_t *)(uintptr_t)pointer;

  if (g_remote[index].packet_type == BK7258_BT_HCI_EVENT_PKT)
    {
      uint8_t header[2];

      memcpy(header, remote, sizeof(header));
      total = sizeof(header) + header[1];
    }
  else
    {
      uint8_t header[4];

      if (!bt_pointer_range(pointer, sizeof(header), BK7258_CP_RAM_START,
                            BK7258_CP_RAM_END))
        {
          return -EFAULT;
        }

      memcpy(header, remote, sizeof(header));
      total = sizeof(header) + bt_get_le16(&header[2]);
    }

  if (total > BLUETOOTH_MAX_FRAMELEN ||
      !bt_pointer_range(pointer, total, BK7258_CP_RAM_START,
                        BK7258_CP_RAM_END))
    {
      return -EMSGSIZE;
    }

  memcpy(data, remote, total);

  if (g_remote[index].packet_type == BK7258_BT_HCI_ACL_DATA_PKT &&
      total >= 4)
    {
      uint16_t handle = bt_get_le16(data);

      if ((handle >> 12) == 0)
        {
          bt_put_le16(data, handle | 0x2000);
        }
    }

  *length = total;
  return OK;
}

static void bt_queue_remote_free(unsigned int index)
{
  irqstate_t flags;
  int ret;

  flags = spin_lock_irqsave(&g_lock);
  g_remote[index].state = BT_REMOTE_FREE_QUEUED;
  ret = bt_queue_push(g_free_queue.entries, &g_free_queue.head,
                      &g_free_queue.count, CONFIG_BK7258_BT_RX_QUEUE,
                      index);
  if (ret < 0)
    {
      g_remote[index].state = BT_REMOTE_QUARANTINED;
      g_stats.rx_free_quarantined++;
    }

  spin_unlock_irqrestore(&g_lock, flags);
  nxsem_post(&g_tx_sem);
}

static void bt_process_remote(unsigned int index)
{
  uint8_t data[BLUETOOTH_MAX_FRAMELEN];
  enum bt_buf_type_e type;
  size_t length;
  int ret;

  ret = bt_read_remote(index, data, &length);
  if (ret < 0)
    {
      irqstate_t flags = spin_lock_irqsave(&g_lock);

      g_stats.rx_rejected++;
      g_remote[index].state = BT_REMOTE_QUARANTINED;
      g_stats.rx_free_quarantined++;
      spin_unlock_irqrestore(&g_lock, flags);
      return;
    }

  if (g_remote[index].packet_type == BK7258_BT_HCI_EVENT_PKT &&
      bt_vendor_event(data, length))
    {
      bt_queue_remote_free(index);
      return;
    }

  type = g_remote[index].packet_type == BK7258_BT_HCI_EVENT_PKT ?
         BT_EVT : BT_ACL_IN;
  if (type == BT_EVT)
    {
      g_stats.rx_events++;
      if (data[0] == 0x3eu || data[0] == 0x05u)
        {
          printf("bt-ipc: event=%02x sub/status=%02x len=%lu\n",
                 data[0], length >= 3 ? data[2] : 0,
                 (unsigned long)length);
        }
    }
  else
    {
      g_stats.rx_acl++;
      printf("bt-ipc: rx-acl len=%lu\n", (unsigned long)length);
    }
  if (g_receive != NULL && (g_host_enabled || type == BT_EVT))
    {
      ret = g_receive(type, data, length, g_receive_arg);
      if (ret >= 0)
        {
          g_stats.rx_delivered++;
        }
      else
        {
          g_stats.rx_rejected++;
        }
    }
  else
    {
      g_stats.rx_rejected++;
    }

  if (type == BT_EVT && (data[0] == 0x05u || data[0] == 0x3eu))
    {
      bk7258_bt_transport_dump_stats();
    }

  bt_queue_remote_free(index);
}

static int bt_rx_worker(int argc, char **argv)
{
  (void)argc;
  (void)argv;

  for (;;)
    {
      uint8_t index;
      irqstate_t flags;
      int ret;

      nxsem_wait_uninterruptible(&g_rx_sem);
      for (;;)
        {
          flags = spin_lock_irqsave(&g_lock);
          ret = bt_queue_pop(g_rx_queue.entries, &g_rx_queue.head,
                             &g_rx_queue.count, CONFIG_BK7258_BT_RX_QUEUE,
                             &index);
          spin_unlock_irqrestore(&g_lock, flags);
          if (ret < 0)
            {
              break;
            }

          bt_process_remote(index);
          bk7258_mbox_kick_rx();
        }

      nxsem_reset(&g_rx_sem, 0);
    }

  return OK;
}

static int bt_wait_pool(unsigned int index, uint32_t generation,
                        clock_t timeout)
{
  clock_t deadline = clock_systime_ticks() + timeout;

  for (;;)
    {
      irqstate_t flags = spin_lock_irqsave(&g_lock);
      bool released = g_tx_pool[index].generation == generation &&
                      g_tx_pool[index].state == BT_POOL_FREE;
      clock_t now = clock_systime_ticks();

      spin_unlock_irqrestore(&g_lock, flags);
      if (released)
        {
          return OK;
        }

