open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_bt_transport.c
      if ((int32_t)(now - deadline) >= 0)
        {
          return -ETIMEDOUT;
        }

      (void)nxsem_tickwait_uninterruptible(&g_pool_sem, deadline - now);
    }
}

static int bt_vendor_control(uint16_t subopcode)
{
  uint8_t command[5];
  unsigned int index;
  uint32_t generation;
  irqstate_t flags;
  int ret;

  bt_put_le16(command, BK7258_BT_VENDOR_OPCODE);
  command[2] = 2;
  command[3] = subopcode >> 8;
  command[4] = subopcode & 0xffu;

  nxsem_reset(&g_vendor_sem, 0);
  flags = spin_lock_irqsave(&g_lock);
  g_vendor_waiting = subopcode;
  g_vendor_status = -EINPROGRESS;
  spin_unlock_irqrestore(&g_lock, flags);

  ret = bt_enqueue_pool(command, sizeof(command),
                        BK7258_BT_HCI_COMMAND_PKT, true, true,
                        &index, &generation);
  if (ret < 0)
    {
      flags = spin_lock_irqsave(&g_lock);
      g_vendor_waiting = 0;
      spin_unlock_irqrestore(&g_lock, flags);
      return ret;
    }

  ret = nxsem_tickwait_uninterruptible(&g_vendor_sem, BT_VENDOR_TIMEOUT);
  if (ret < 0)
    {
      return ret;
    }

  flags = spin_lock_irqsave(&g_lock);
  ret = g_vendor_status;
  spin_unlock_irqrestore(&g_lock, flags);
  if (ret < 0)
    {
      return ret;
    }

  return bt_wait_pool(index, generation, BT_VENDOR_TIMEOUT);
}

int bk7258_bt_transport_initialize(void)
{
  int ret;

  if (g_initialized)
    {
      return OK;
    }

  memset(g_tx_pool, 0, sizeof(g_tx_pool));
  memset(g_remote, 0, sizeof(g_remote));
  memset(&g_normal_queue, 0, sizeof(g_normal_queue));
  memset(&g_control_queue, 0, sizeof(g_control_queue));
  memset(&g_rx_queue, 0, sizeof(g_rx_queue));
  memset(&g_free_queue, 0, sizeof(g_free_queue));
  memset(&g_current, 0, sizeof(g_current));
  memset(&g_stats, 0, sizeof(g_stats));
  nxsem_init(&g_tx_sem, 0, 0);
  nxsem_init(&g_rx_sem, 0, 0);
  nxsem_init(&g_vendor_sem, 0, 0);
  nxsem_init(&g_pool_sem, 0, 0);

  ret = bk7258_mailbox_register_rx(BK7258_MB_CHAN_BT_RX,
                                   bt_mailbox_rx, NULL);
  if (ret < 0)
    {
      return ret;
    }

  if (!g_workers_created)
    {
      ret = kthread_create("bt-ipc-tx", BT_TX_PRIORITY, BT_WORKER_STACK,
                           bt_tx_worker, NULL);
      if (ret < 0)
        {
          return ret;
        }

      ret = kthread_create("bt-ipc-rx", BT_RX_PRIORITY, BT_WORKER_STACK,
                           bt_rx_worker, NULL);
      if (ret < 0)
        {
          return ret;
        }

      g_workers_created = true;
    }

  g_initialized = true;
  return OK;
}

void bk7258_bt_transport_set_receiver(bk7258_bt_receive_t receive, void *arg)
{
  irqstate_t flags = spin_lock_irqsave(&g_lock);

  g_receive = receive;
  g_receive_arg = arg;
  spin_unlock_irqrestore(&g_lock, flags);
}

int bk7258_bt_transport_open(void)
{
  int ret;

  if (!g_initialized || !bk7258_mailbox_link_ready())
    {
      return -ENOLINK;
    }

  ret = bt_vendor_control(BK7258_BT_VENDOR_INIT);
  if (ret == OK)
    {
      irqstate_t flags = spin_lock_irqsave(&g_lock);

      g_host_enabled = true;
      spin_unlock_irqrestore(&g_lock, flags);
    }

  return ret;
}

int bk7258_bt_transport_send(enum bt_buf_type_e type,
                             const void *data, size_t length)
{
  uint8_t packet_type;
  irqstate_t flags;
  bool enabled;
  int ret;

  if (data == NULL || length > BLUETOOTH_MAX_FRAMELEN)
    {
      return -EINVAL;
    }

  flags = spin_lock_irqsave(&g_lock);
  enabled = g_host_enabled;
  spin_unlock_irqrestore(&g_lock, flags);
  if (!enabled)
    {
      return -ESHUTDOWN;
    }

  if (type == BT_CMD)
    {
      const uint8_t *command = data;
      uint16_t opcode;

      if (length < 3 || command[2] != length - 3)
        {
          return -EMSGSIZE;
        }

      packet_type = BK7258_BT_HCI_COMMAND_PKT;
      opcode = bt_get_le16(command);
      /* printf("bt-ipc: tx-cmd opcode=%04x len=%lu\n",
             (unsigned int)opcode, (unsigned long)length); */

      if (opcode == BT_HCI_OP_HOST_BUFFER_SIZE)
        {
          bt_inject_command_complete(opcode);
          return (int)length;
        }

      if (opcode == BT_HCI_OP_HOST_NUM_COMPLETED_PACKETS)
        {
          return (int)length;
        }

    }
  else if (type == BT_ACL_OUT)
    {
      const uint8_t *acl = data;

      if (length < 4 || bt_get_le16(&acl[2]) != length - 4)
        {
          return -EMSGSIZE;
        }

      packet_type = BK7258_BT_HCI_ACL_DATA_PKT;
      printf("bt-ipc: tx-acl len=%lu\n", (unsigned long)length);
    }
  else
    {
      return -EINVAL;
    }

  ret = bt_enqueue_pool(data, length, packet_type, false, type == BT_CMD,
                        NULL, NULL);
  return ret < 0 ? ret : (int)length;
}

void bk7258_bt_transport_close(void)
{
  irqstate_t flags = spin_lock_irqsave(&g_lock);

  g_host_enabled = false;
  spin_unlock_irqrestore(&g_lock, flags);
  (void)bt_vendor_control(BK7258_BT_VENDOR_DEINIT);
}

void bk7258_bt_transport_get_stats(struct bk7258_bt_stats *stats)
{
  irqstate_t flags;

  if (stats == NULL)
    {
      return;
    }

  flags = spin_lock_irqsave(&g_lock);
  *stats = g_stats;
  spin_unlock_irqrestore(&g_lock, flags);
}

void bk7258_bt_transport_dump_stats(void)
{
  struct bk7258_bt_stats stats;

  bk7258_bt_transport_get_stats(&stats);
  printf("bt-ipc: tx=%lu cmd=%lu acl=%lu ack=%lu ackerr=%lu free=%lu "
         "unknown_free=%lu quarantine=%lu rx=%lu evt=%lu acl=%lu "
         "delivered=%lu rejected=%lu duplicate=%lu "
         "free_ack=%lu free_quarantine=%lu queue_full=%lu "
         "last_remote=%08lx/%02x\n",
         (unsigned long)stats.tx_enqueued,
         (unsigned long)stats.tx_commands,
         (unsigned long)stats.tx_acl,
         (unsigned long)stats.tx_ack,
         (unsigned long)stats.tx_ack_error,
         (unsigned long)stats.tx_free,
         (unsigned long)stats.tx_unknown_free,
         (unsigned long)stats.tx_quarantined,
         (unsigned long)stats.rx_enqueued,
         (unsigned long)stats.rx_events,
         (unsigned long)stats.rx_acl,
         (unsigned long)stats.rx_delivered,
         (unsigned long)stats.rx_rejected,
         (unsigned long)stats.rx_duplicate,
         (unsigned long)stats.rx_free_ack,
         (unsigned long)stats.rx_free_quarantined,
         (unsigned long)stats.queue_full,
         (unsigned long)stats.last_remote_pointer,
         stats.last_remote_type);
}
